Tekla Open API Reference for Tekla Structures 2025
ApplicationWindowBase Constructor
 The default constructor that does not need parameters. Initializes the window, property binding can be initialized with InitializeDataStorage()-method.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ApplicationWindowBase()
Public Sub New
See Also
Reference
ApplicationWindowBase Class
Tekla.Structures.Dialog Namespace